Revit 2027 API
AreaVolumeSettings.SetSpatialElementBoundaryLocation Method
 Sets the spatial element boundary location of a spatial element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSpatialElementBoundaryLocation(
	SpatialElementBoundaryLocation spatialElementBoundaryLocation,
	SpatialElementType spType
)
Public Sub SetSpatialElementBoundaryLocation (
	spatialElementBoundaryLocation As SpatialElementBoundaryLocation,
	spType As SpatialElementType
)
public:
void SetSpatialElementBoundaryLocation(
	SpatialElementBoundaryLocation spatialElementBoundaryLocation,
	SpatialElementType spType
)
member SetSpatialElementBoundaryLocation :
        spatialElementBoundaryLocation : SpatialElementBoundaryLocation *
        spType : SpatialElementType -> unit
Parameters
spatialElementBoundaryLocation SpatialElementBoundaryLocation
 The boundary location.
spType SpatialElementType
 The spatial element type.
Exceptions
Exception | Condition
ArgumentException |  Currently only SpatialElementType.Room is permitted when setting the boundary location.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace